000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ADDCICS.
000300
000400*************************************************
000500*   A SAMPLE COBOL/CICS PROGRAM TO ADD 2 +VE NOS*
000600*                                               *
000610*     Testing cics pgm  testing                 *
000620*     Testing for PyZBuild.                     *  
000700*************************************************
000800*   COLORS AVAILABLE
000900*    DFHRED      X'F0'  - RED
001000*    DFHGREEN    X'F1'  - GREEN
001100*    DFHYELLO    X'F2'  - YELLOW
001200*    DFHTURQ     X'F3'  - TURQUOISE
001300*    DFHPINK     X'F4'  - PINK
001400*    DFHBLUE     X'F5'  - BLUE
001500*    DFHNEUTR    X'F7'  - NEUTRAL/WHITE
001600*   HILIGHTS AVAILABLE
001700*    DFHBLINK           - BLINK
001800*    DFHREVRS           - FOREGR AND BACK GR COLORS REVERSE
001900*    DFHUNDLN           - UNDERLINE
002000
002100 ENVIRONMENT DIVISION.
002200
002300 DATA DIVISION.
002400
002500 WORKING-STORAGE SECTION.
002600 01 WS-NUM1          PIC 9(03).
002610 01 WS-NUM01         PIC 9(03).
002620 01 WS-NUM02         PIC 9(03).
002700 01 WS-NUM2          PIC 9(03).
002800 01 WS-RESULT        PIC 9(04).
002900 01 WS-COMMAREA      PIC X(10).
003000
003100     COPY ADDMS01.
003200     COPY DFHAID.
003300     COPY DFHBMSCA.
003400
003500 LINKAGE SECTION.
003600
003700 01 DFHCOMMAREA      PIC X(10).
003800
003900 PROCEDURE DIVISION.
004000     MOVE DFHCOMMAREA TO WS-COMMAREA
004100     IF EIBCALEN = ZERO
004200       MOVE LOW-VALUES TO ADDM01O
004300       MOVE -1 TO NUM1L
004400       PERFORM 100-SEND-MAP
004500     ELSE
004600       PERFORM 200-PROC-MAP
004700     END-IF.
004800
004900 100-SEND-MAP.
005000
005100     EXEC CICS SEND
005200        MAP    ('ADDM01')
005300        MAPSET ('ADDMS01')
005400        FROM   (ADDM01O)
005500        LENGTH (LENGTH OF ADDM01O)
005600        ERASE
005700        CURSOR
005800     END-EXEC.
005900
006000     EXEC CICS
006100        RETURN TRANSID('AD01')
006200        COMMAREA (WS-COMMAREA)
006300     END-EXEC.
006400
006500 200-PROC-MAP.
006600     EVALUATE TRUE
006700       WHEN EIBAID = DFHPF3
006800         MOVE LOW-VALUES TO  ADDM01O
006900         MOVE -1         TO  MSG1L
007000         MOVE "BYE, PRESS CLEAR KEY TO EXIT" TO MSG1O
007100         PERFORM EXIT-PARA
007200
007300       WHEN EIBAID = DFHENTER
007400         PERFORM RECEIVE-MAP
007500         PERFORM 300-ADD-NUMBERS
007600
007700       WHEN OTHER
007800         MOVE LOW-VALUES TO ADDM01O
007900         MOVE "INVALID KEY PRESSED" TO MSG1O
008000         PERFORM 100-SEND-MAP
008100
008200     END-EVALUATE.
008300
008400 RECEIVE-MAP.
008500      EXEC CICS RECEIVE
008600        MAP    ('ADDM01')
008700        MAPSET ('ADDMS01')
008800        INTO   (ADDM01I)
008900      END-EXEC.
009000
009100 300-ADD-NUMBERS.
009200     MOVE LOW-VALUES TO MSG1O
009300     IF NUM1I IS NUMERIC
009400        MOVE NUM1I TO WS-NUM1
009500     ELSE
009600        MOVE -1 TO NUM1L
009700        MOVE DFHNEUTR TO MSG1C
009800        MOVE DFHRED TO NUM1C
009900        MOVE DFHGREEN TO NUM2C
010000        MOVE DFHYELLO TO RESC
010100        MOVE DFHBLUE  TO LABEL1C
010200        MOVE DFHBLINK   TO MSG1H
010300        MOVE 20        TO MSG1L
010400        MOVE 'NUM1 IS NOT NUMERIC' TO MSG1O
010500     PERFORM 100-SEND-MAP
010600     END-IF
010700
010800     MOVE LOW-VALUES TO MSG1O
010900     IF NUM2I IS NUMERIC
011000        MOVE NUM2I TO WS-NUM2
011100     ELSE
011200        MOVE -1 TO NUM2L
011300        MOVE 'NUM2 IS NOT NUMERIC' TO MSG1O
011400     PERFORM 100-SEND-MAP
011500     END-IF
011600
011700     COMPUTE WS-RESULT = WS-NUM1 + WS-NUM2
011800     MOVE WS-RESULT TO RESO
011900     MOVE -1 TO NUM1L
012000*    MOVE X'C2' TO RESH
012100     PERFORM 100-SEND-MAP.
012200
012300 EXIT-PARA.
012400     EXEC CICS SEND
012500        MAP    ('ADDM01')
012600        MAPSET ('ADDMS01')
012700        FROM   (ADDM01O)
012800        ERASE
012900     END-EXEC.
013000
013100     EXEC CICS
013200          RETURN
013300     END-EXEC.
