000100 IDENTIFICATION DIVISION.
000200*
000300 PROGRAM-ID. UPDDB2.
000400****************************************************************
000500*                  D E S C R I P T I O N                       *
000600*                  ---------------------                       *
000700*                                                              *
000800*          UPDDB2  - UPDATE THE BASE VSAM FILE.                *
000900*                                                              *
001000*    THIS PROGRAM READS THE INPUT FILE AND CHECK THE RECORD    *
001100*    IN VSAM.                                                  *
001200*                                                              *
001300*    IF RECORD FOUND IT WILL UPDATE IN VSAM.                   *
001400*    IF NO-REC FOUND IT WILL WRITE IN A REPORT FILE.           *
001500*                                                              *
001600****************************************************************
001700 ENVIRONMENT DIVISION.
001800*
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER. IBM-PC.
002100 OBJECT-COMPUTER. IBM-PC.
002200 INPUT-OUTPUT  SECTION.
002300*
002400 FILE-CONTROL.
002500*
002600      SELECT IN-FILE ASSIGN TO INPUTF
002700      ORGANIZATION IS SEQUENTIAL
002800      ACCESS MODE IS SEQUENTIAL
002900      FILE STATUS IS WS-INPUT-STS.
003000*
003100      SELECT BASE-FILE ASSIGN TO BASEF
003200      ORGANIZATION IS INDEXED
003300      ACCESS MODE IS RANDOM
003400      RECORD KEY IS BASE-KEY
003500      FILE STATUS IS WS-BASE-STS.
003600*
003700      SELECT REJ-FILE ASSIGN TO REJECTF
003800      ORGANIZATION IS SEQUENTIAL
003900      ACCESS MODE IS SEQUENTIAL
004000      FILE STATUS IS WS-REJECT-STS.
004100*
004200 DATA DIVISION.
004300*
004400 FILE SECTION.
004500*
004600 FD IN-FILE.
004700 01  INP-CARD-REC.
004800     03 INP-KEY.
004900        05 INP-ACCT-NUMBER       PIC  X(19).
005000        05 INP-ORG               PIC  9(03).
005100     03 INP-CR-LIMIT             PIC  9(04).
005200     03 FILLER                   PIC  X(174).
005300*
005400 FD REJ-FILE.
005500 01  RJF-CARD-REC.
005600     03 RJF-ACCT-NUMBER          PIC  X(19).
005700     03 FILLER                   PIC  X(02).
005800     03 RJF-ORG                  PIC  9(03).
005900     03 FILLER                   PIC  X(02).
006000     03 RJF-CR-LIMIT             PIC  X(04).
006100     03 FILLER                   PIC  X(02).
006200     03 RJF-REASON               PIC  X(40).
006300     03 FILLER                   PIC  X(128).
006400*
006500 FD  BASE-FILE.
006600     COPY BASERL.
006700*
006800 WORKING-STORAGE SECTION.
006900*
007000 01  WS-WORKING-VARIABLES.
007100*
007200     03  WS-INPUT-STS            PIC  X(02)  VALUE SPACES.
007300     03  WS-REJECT-STS           PIC  X(02)  VALUE SPACES.
007400     03  WS-BASE-STS             PIC  X(02)  VALUE SPACES.
007410     03  WS-BASE-STS-2           PIC  X(02)  VALUE SPACES.
007500*
007600     03  WS-ABEND.
007700         05 WS-RTNCODE           PIC  S9(9)  VALUE 9999.
007800         05 WS-TIMING            PIC  S9(9)  VALUE ZEROS.
007900*
008000     03  WS-REWRITE-COUNTER      PIC  9(02)  VALUE ZEROS.
008100*
008200     03  WS-EOF                  PIC  X(01)  VALUE 'N'.
008300         88 WS-EOF-YES                       VALUE 'Y'.
008400         88 WS-EOF-NO                        VALUE 'N'.
008500*
008600     03  WS-REJECT-REASON        PIC  X(40)  VALUE
008700                     'RECORD NOT FOUND IN BASE FILE'.
008800*
008900     03  WS-CR-LIMIT             PIC  9(04)  VALUE ZEROS.
009000*
009100 PROCEDURE DIVISION.
009200*
009300 0000-MAIN-LINE-PARA.
009400*
009500      PERFORM 1000-OPEN-PARA
009600         THRU 1999-OP-EXIT
009700*
009800      PERFORM 2000-PROCESS-PARA
009900         THRU 2999-PR-EXIT
010000        UNTIL WS-EOF = 'Y'
010100*
010200      PERFORM 8000-CLOSE-PARA
010300         THRU 8999-CP-EXIT
010400*
010500      STOP RUN.
010600*
010700 9999-MAIN-LINE-EXIT.
010800*
010900*----------------------*
011000*     OPEN-PARA        *
011100*----------------------*
011200 1000-OPEN-PARA.
011300*
011400     OPEN INPUT IN-FILE
011500*
011600     IF  WS-INPUT-STS IS EQUAL TO ZEROS
011700         CONTINUE
011800     ELSE
011900         DISPLAY 'OPEN-INPUT FAILED : ' WS-INPUT-STS
012000         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
012100         GOBACK
012200     END-IF
012300*
012400     OPEN I-O BASE-FILE
012500
012600     IF  WS-BASE-STS IS EQUAL TO ZEROS
012700         CONTINUE
012800     ELSE
012900         DISPLAY 'OPEN BASE-FILE FAILED : ' WS-BASE-STS
013000         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
013100         GOBACK
013200     END-IF
013300*
013400     OPEN OUTPUT REJ-FILE
013500*
013600     IF  WS-REJECT-STS IS EQUAL TO ZEROS
013700         CONTINUE
013800     ELSE
013900         DISPLAY 'OPEN-OUTPUT FAILED : ' WS-REJECT-STS
014000         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
014100         GOBACK
014200     END-IF
014300*
014400     PERFORM 2200-READ-INPUT-PARA
014500        THRU 2299-RIP-EXIT.
014600*
014700 1999-OP-EXIT.
014800     EXIT.
014900*
015000*----------------------*
015100*     PROCESS-PARA     *
015200*----------------------*
015300 2000-PROCESS-PARA.
015400*
015500     PERFORM 2400-READ-BF-PARA
015600        THRU 2499-RBF-EXIT.
015700*
015800     PERFORM 2200-READ-INPUT-PARA
015900        THRU 2299-RIP-EXIT.
016000*
016100 2999-PR-EXIT.
016200     EXIT.
016300*
016400*----------------------*
016500*   READ-PARA          *
016600*----------------------*
016700 2200-READ-INPUT-PARA.
016800*
016900     READ IN-FILE
017000          AT END
017100                MOVE 'Y'         TO WS-EOF
017200          NOT AT END
017300                MOVE INP-KEY     TO BASE-KEY
017400     END-READ.
017500*
017600 2299-RIP-EXIT.
017700     EXIT.
017800*
017900*
018000 2400-READ-BF-PARA.
018100*
018200     DISPLAY '2400-READ-BF-PARA :'
018300*
018400     READ BASE-FILE
018500     END-READ
018600*
018700     IF  WS-BASE-STS IS EQUAL TO ZEROS
018800*
018900         COMPUTE BASE-CR-LIMIT = BASE-CR-LIMIT + INP-CR-LIMIT
018910         MOVE 'TEST'            TO BASE-TESTING-FEILD
019000*
019100         PERFORM 2500-REWRITE-BF-PARA
019200            THRU 2599-RBF-EXIT
019300     ELSE
019400          PERFORM 2600-BUILD-OUT-PARA
019500             THRU 2699-BOP-EXIT
019600     END-IF.
019700*
019800 2499-RBF-EXIT.
019900     EXIT.
020000*
020100 2500-REWRITE-BF-PARA.
020200*
020400     DISPLAY 'BASE-KEY : ' BASE-KEY
020450     DISPLAY 'CR-LIMIT : ' BASE-CR-LIMIT
020460     DISPLAY 'BASE-TESTING-FEILD : ' BASE-TESTING-FEILD
020500*
020600     REWRITE BASE-CARD-REC
020700     END-REWRITE
020800*
020900     IF  WS-BASE-STS IS EQUAL TO ZEROS
021000         ADD +1 TO WS-REWRITE-COUNTER
021100     ELSE
021200         DISPLAY 'REWRITE - BASE FILE FAILED : ' WS-BASE-STS
021300         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
021400         GOBACK
021500     END-IF.
021600*
021700 2599-RBF-EXIT.
021800     EXIT.
021900*
022000 2600-BUILD-OUT-PARA.
022100*
022200     MOVE SPACES                 TO RJF-CARD-REC
022300*
022400     MOVE INP-ACCT-NUMBER        TO RJF-ACCT-NUMBER
022500     MOVE INP-ORG                TO RJF-ORG
022600     MOVE INP-CR-LIMIT           TO RJF-CR-LIMIT
022700     MOVE WS-REJECT-REASON       TO RJF-REASON
022800*
022900     WRITE RJF-CARD-REC
023000*
023100     IF  WS-REJECT-STS IS EQUAL TO ZEROS
023200         CONTINUE
023300     ELSE
023400         DISPLAY 'WRITE OUTPUT FAILED : ' WS-REJECT-STS
023500         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
023600         GOBACK
023700     END-IF .
023800*
023900 2699-BOP-EXIT.
024000     EXIT.
024100*
024200*----------------------*
024300*   CLOSE-PARA         *
024400*----------------------*
024500 8000-CLOSE-PARA.
024600*
024700     CLOSE IN-FILE
024800*
024900     IF  WS-INPUT-STS IS EQUAL TO ZEROS
025000         CONTINUE
025100     ELSE
025200         DISPLAY 'CLOSE-INPUT FAILED : ' WS-INPUT-STS
025300         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
025400         GOBACK
025500     END-IF
025600*
025700     CLOSE BASE-FILE
025800*
025900     IF  WS-BASE-STS IS EQUAL TO ZEROS
026000         CONTINUE
026100     ELSE
026200         DISPLAY 'CLOSE-BASE FILE FAILED : ' WS-BASE-STS
026300         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
026400         GOBACK
026500     END-IF
026600*
026700     CLOSE REJ-FILE
026800*
026900     IF  WS-REJECT-STS IS EQUAL TO ZEROS
027000         CONTINUE
027100     ELSE
027200         DISPLAY 'CLOSE-OUTPUT FAILED : ' WS-REJECT-STS
027300         CALL "CEE3ABD" USING WS-RTNCODE, WS-TIMING
027400         GOBACK
027500     END-IF
027600*
027700     DISPLAY 'NUMBER OF RECORDS REWRITTEN  : ' WS-REWRITE-COUNTER.
027800*
027900 8999-CP-EXIT.
028000     EXIT.